import { QuestionItem } from "../interfaces/common.interface";

export const MOCK_QUESTIONS: QuestionItem[] = [
  {
    question:
      "채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요. 채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "basic",
  },
  {
    question:
      "채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요. 채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요. ",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "basic",
  },
  {
    question:
      "채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "basic",
  },
  {
    question:
      "채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요.  주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "experience",
  },
  {
    question:
      "채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요. 주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "experience",
  },
  {
    question:
      "채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요.  주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "experience",
  },
  {
    question:
      "채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "experience",
  },
  {
    question:
      "채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히  채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요. 설명해 주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "experience",
  },
  {
    question:
      "채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "experience",
  },
  {
    question:
      "채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히  채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요. 설명해 주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "experience",
  },
  {
    question:
      "채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요.  설명해 주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "experience",
  },
  {
    question:
      "채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "job_related",
  },
  {
    question:
      "자신이 팀 프로젝트에서 맡았채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요. 던 역할과 성과를 구체적으로 설명해 주세요.",
    based_on: "이력서의 '배움과 성장' 섹션",
    section: "job_related",
  },
  {
    question:
      "채용공고에 나온 '고가채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요. 용성 설계' 경험이 있으신가요? 자세히 설명해 주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "job_related",
  },
  {
    question:
      "채용공고에 나온 '고가용성채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요.  설계' 경험이 있으신가요? 자세히 설명해 주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "job_related",
  },
  {
    question:
      "채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "expertise",
  },
  {
    question:
      "채용공고에 나온 '고가용채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요. 성 설계' 경험이 있으신가요? 자세히 설명해 주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "expertise",
  },
  {
    question:
      "채용공고에 나온 '고가용채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요. 성 설계' 경험이 있으신가요? 자세히 설명해 주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "expertise",
  },
  {
    question:
      "채용공고에 나온 '고가채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요. 용성 설계' 경험이 있으신가요? 자세히 설명해 주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "expertise",
  },
  {
    question:
      "채용공고에 나온 '고채용공고에 나온 '고가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요. 가용성 설계' 경험이 있으신가요? 자세히 설명해 주세요.",
    based_on: "채용공고의 '고가용성 설계' 키워드",
    section: "expertise",
  },
];
